test/artillery-test.yml
config:
  target: "{{ $env.BASE_URL }}"
  phases:
    - name: Warm-up
      duration: 20
      arrivalRate: 20
    - name: Ramp-up
      duration: 60
      arrivalRate: 60
      rampTo: 120
    - name: Sustained load
      duration: 300
      arrivalRate: 120
  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"
  http:
    timeout: 10
    pool: 50
  plugins:
    expect: {} # enable assertions

scenarios:
  - name: "Access frontend homepage"
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - contentType:  text/html; charset=utf-8
      - think: 1
      
  - name: "Login and view dashboard"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $env.TEST_EMAIL }}"
            password: "{{ $env.TEST_PASSWORD }}"
          capture:
            - json: "$.accessToken"
              as: accessToken
          expect:
            - statusCode: 200
            - contentType: json
          log: false
      - think: 2

      - get:
          url: "/dashboard"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200